export default function page() {
  return (
    <main>
      <h1 className="text-2xl font-bold text-center">
        Публичная оферта о заключении договора пожертвования
      </h1>
      <section className="px-10">
        <p>
          Настоящая публичная оферта адресована физическим и (или) юридическим
          лицам (далее - Благотворители) и является официальным предложением
          <strong> Ибрагимова Никиты Сергеевича</strong> (далее -
          Благополучатель), действующего на основании законодательства
          Российской Федерации, заключить договор пожертвования денежных средств
          (далее - Договор) в соответствии с п. 2 ст. 437 Гражданского кодекса
          Российской Федерации о нижеследующем:
        </p>

        <ol className="counter-reset-section">
          <li>
            <strong>Предмет Договора</strong>
            <ol className="pl-5 counter-reset-subsection">
              <li>
                Благотворитель безвозмездно передает денежные средства (далее -
                Пожертвование) на ведение уставной деятельности Благополучателя
                и его содержание.
              </li>
              <li>
                Благополучатель принимает Пожертвование, поступившее в рамках
                Договора, для финансирования своей деятельности, включая
                создание контента, поддержание технической инфраструктуры и
                улучшение качества предоставляемых услуг.
              </li>
              <li>
                Договор является договором присоединения. Благотворителем
                принимаются условия Договора путем присоединения к нему в целом.
                При этом Благотворитель подтверждает, что Договор не содержит
                обременительных для него условий, которые он не принял бы при
                наличии у него возможности участвовать в определении условий
                настоящего Договора.
              </li>
            </ol>
          </li>
          <li>
            <strong>Порядок заключения Договора</strong>
            <ol className="pl-5 counter-reset-subsection">
              <li>
                Договор считается заключенным с момента передачи Благотворителем
                Пожертвования в порядке, определенном настоящим Договором, что
                означает безоговорочное принятие всех его условий без каких-либо
                изъятий или ограничений.
              </li>
              <li>
                Благотворитель самостоятельно определяет размер Пожертвования и
                вносит его путем перечисления денежных средств на банковский
                счет Благополучателя, указанный в разделе 4 настоящей Оферты,
                любым удобным способом, указанным на сайте или в описании
                Благополучателя.
              </li>
              <li>
                В графе <strong>«</strong>назначение платежа
                <strong>»</strong> Благотворитель указывает - <strong>«</strong>
                Пожертвование<strong>»</strong>.
              </li>
              <li>
                Благотворитель может также дополнительно указать конкретную цель
                использования Пожертвования, например, на улучшение технического
                оборудования или создание нового контента.
              </li>
              <li>
                В случае невозможности использовать Пожертвование на
                определенную Благотворителем цель и (или) при получении
                Пожертвования без указания конкретной цели его использования
                Благополучатель имеет право по своему усмотрению использовать
                такие Пожертвования на ведение своей уставной деятельности и
                свое содержание.
              </li>
              <li>
                При перечислении Пожертвования в целях идентификации
                Благотворитель указывает свои контакты: Ф.И.О./наименование
                юридического лица, адрес электронной почты и (или) телефонный
                номер.
              </li>
              <li>
                Пожертвование считается переданным Благополучателю с момента
                зачисления его на банковский счет, указанный в разделе 4
                настоящей Оферты.
              </li>
              <li>
                Оферта является бессрочной и действует до дня, следующего за
                днем размещения на сайте Благополучателя извещения о прекращении
                действия оферты.
              </li>
              <li>
                Местом заключения Договора является место нахождения
                Благополучателя.
              </li>
            </ol>
          </li>
          <li>
            <strong>Условия Договора</strong>
            <ol className="pl-5 counter-reset-subsection">
              <li>
                Благополучатель обязан публиковать отчеты о целевом
                использовании Пожертвований, полученных в течение календарного
                года. Отчеты публикуются в сети Интернет на сайте или в
                социальных сетях Благополучателя не позднее 31 января следующего
                года.
              </li>
              <li>
                Благотворитель обязан использовать полученное по Договору
                Пожертвование исключительно на цели, указанные в п. 1.2
                настоящего документа.
              </li>
              <li>
                Заключая Договор, Благотворитель, действуя своей волей и в своем
                интересе, дает согласие на обработку Благополучателем его
                персональных данных, а именно на совершение, в том числе
                действий по сбору, систематизации, накоплению, хранению,
                уточнению (в том числе обновлению, изменению), использованию,
                распространению, обезличиванию, блокированию и уничтожению любой
                информации, относящейся к персональным данным Благотворителя, с
                целью заключения и исполнения Договора.
              </li>
              <li>
                В соответствии с Федеральным законом от 27.07.2006 N 152-ФЗ{" "}
                <strong>«</strong>О персональных данных
                <strong>»</strong> Благополучатель не разглашает предоставленные
                Благотворителем при перечислении Пожертвования персональные
                данные без его письменного согласия.
              </li>
              <li>
                Стороны несут полную ответственность за соблюдение требований
                Договора, в том числе ответственность за предоставленные
                сведения о себе.
              </li>
              <li>
                Каждая из Сторон подтверждает, что она имеет все права и
                полномочия на заключение Договора и исполнение установленных им
                обязательств, а также что заключение Договора не нарушает
                условий иных обязательств Сторон перед третьими лицами.
              </li>
              <li>
                Стороны освобождаются от ответственности за неисполнение или
                ненадлежащее исполнение обязательств по Договору, если это
                неисполнение явилось следствием форс-мажора - обстоятельств
                непреодолимой силы, возникших после заключения Договора в
                результате событий чрезвычайного характера, которые Сторона(ы)
                не могла(и) ни предвидеть, ни предотвратить разумными мерами.
              </li>
              <li>
                Во всем остальном, что не предусмотрено Договором, Стороны
                руководствуются действующим законодательством Российской
                Федерации.
              </li>
            </ol>
          </li>
          <li>
            <strong>Реквизиты Благополучателя</strong>
            <ul className="pl-5">
              <li>Полное наименование: Ибрагимов Никита Сергеевич</li>
              <li>ИНН: 182402617697</li>
              <li>Расчетный счет: 40817810400108495875</li>
              <li>Наименование банка получателя: АО ТБанк</li>
              <li>Корреспондентский счёт: 30101810145250000974</li>
              <li>БИК банка получателя: 044525974</li>
            </ul>
          </li>
        </ol>
      </section>
    </main>
  );
}
